


### 概要

## 特徴

# 動的型付け言語

# 短絡評価 ...式全体の真偽値が確定した時点で処理を終了する評価法



## 実行

# require ...標準ライブラリの読み込み
#- rubyファイルの読み込みは非推奨

# require_relative ...Rubyプログラムの読み込み
#- 独自のクラス定義など、ファイル読み込み





###その他


## 用語の説明

# 静的型付け言語 ...メソッド実行前にメソッドが呼び出せることを保証する。それ以外はエラー
# 抽象クラス
# インターフェース
# オーバーライド(多重定義) ...引数の個数やデータ型の異なるメソッドを複数定義できること。


# 動的型付け言語 ...メソッド実行時に呼び出せるかを判断。呼び出せない場合にエラー





### 参考サイト


## 参照前

# https://zenn.dev/universato/articles/20201210-z-ruby
#- 競プロTips

# https://github.com/JunichiIto/ruby-book-codes-v2/tree/main/ruby-book
#- プロになるためのRuby入門




# 参照済み
